springbootws/src/test/resources/example_request_get.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="http://spring.io/guides/gs-producing-web-service">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:getQuotationsRequest>
        </ns2:getQuotationsRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>